bbulkow/esp32/wifi_station/main/wifi_station_main.c
/* WiFi station example

** but with continual scanning of multiple APs
** so you can easily connect to different ones
** attempting to support ESP-IDF 4.0 and upward
**
** Portions copyright Brian Bulkowski, (c) 2020
** brian@bulkowski.org

   Unless required by applicable law or agreed to in writing, this
   software is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
   CONDITIONS OF ANY KIND, either express or implied.
*/
#include <string.h>
#include <stdbool.h>
#include <stdint.h>
#include <inttypes.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "freertos/semphr.h"

#include "esp_system.h"
#include "esp_event.h"
#include "esp_timer.h"
#include "esp_wifi.h"
#include "esp_log.h"
#include "nvs_flash.h"
#include "esp_idf_version.h"  // several bits of code depend on version :-(

#include "lwip/err.h"
#include "lwip/sys.h"

#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(4,1,0)
    This file uses the new ESP-IDF networking system, so only supports ESP-IDF 4.1 and later.
#endif

/*
** a quick note about scanning and memory use.
** the esp_idf scan interface is poorly defined. You execute a scan, you get notified that it's
** complete, then you must call esp_wifi_scan_get_ap_records(), because that copies the details
** into your own buffer, and also frees the dynamic memory associated with the scan.
** There is no description of what happens if you call the scan and not the 'get_ap_records'.
** There is also a potential race because you have to get the number of records then get the
** records itself, so you better not be doing a background scan at the same time.
**
** While this interface is fragile, it works, just if you are doing async programming, you need to make sure
** you don't start a new scan until you pull the old scan data out, or something similar.
**
** Note to espressif. You should define in your documentation what happens if you don't call 'get_ap_records'
** after a scan, repeatedly. I have raised an issue in the github repo but whatever.
**
** I think the safest thing is a mutex to make sure there isn't concurrent access. I think trying to make
** certain there is a 1-for-1 access ot that function is too hard.
*/

/*
** NOTE TO SELF! ESP_ERROR_CHECK() calls ASSERT if there is an error, which
** almost certainly results in a reboot. If an error is recoverable, 
** ESP_OK is generally the OK state for all the esp_ calls, and see this page
** about it all.... 
** https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-guides/error-handling.html
*/

/* The examples use WiFi configuration that you can set via project configuration menu

   If you'd rather not, just change the below entries to strings with
   the config you want - ie #define EXAMPLE_WIFI_SSID "mywifissid"
*/
#define EXAMPLE_ESP_WIFI_SSID      CONFIG_ESP_WIFI_SSID
#define EXAMPLE_ESP_WIFI_PASS      CONFIG_ESP_WIFI_PASSWORD
#define EXAMPLE_ESP_MAXIMUM_RETRY  CONFIG_ESP_MAXIMUM_RETRY

/* FreeRTOS event group to signal when we are connected*/
static EventGroupHandle_t s_wifi_event_group;

/* there seem to be a new thing, the esp_netif_t, which you need to attach to the wifi system.
** I don't think it happens by default anymore, which is why I am not getting an IP address
*/
static esp_netif_t *g_wifi_netif = 0;

/* The event group allows multiple bits for each event, but we only care about one event 
 * - are we connected to the AP with an IP? */
const int WIFI_CONNECTED_BIT = BIT0;

static const char *TAG = "wifi station";

static int s_retry_num = 0;

static bool g_is_connected = false;
static bool g_is_connecting = false;
static bool g_is_scanning = false;

// using a microsecond timer, make it ten seconds?
#define WIFI_STALE_TIME (20L * 1000L * 1000L)


///
/// local structures
//

#define SSID_LEN 32
#define PASSWORD_LEN 64

// this will hold the different APs the client might want to connect to
typedef struct wifi_ap_info_s {
    struct wifi_ap_info_s *next; // single linked list null at end, fairly memory efficient
    uint8_t ssid[SSID_LEN]; // chars are more normal than uint8 which esp-idf uses, null terminated
    uint8_t password[PASSWORD_LEN]; // again, chars
    wifi_auth_mode_t authmode; // should be set by a scan?
        // WIFI_AUTH_OPEN, WIFI_AUTH_WEP, WIFI_AUTH_WPA_PSK, WIFI_AUTH_WAP_WAP@_PSK
        // WIFI_AUTH_WPA2_ENTERPRISE, WIFI_AUTH_WPA3_PSK
    int   successes;
    int   fails;
    wifi_err_reason_t wifi_err; // if failed, last error set here - don't keep trying if wrong password
                                // it turns out that password is "4th handshake" usually.
    int             last_rssi;
    int64_t         last_seen; // microsec ticks since last seen
} wifi_ap_info_t;

static wifi_ap_info_t *g_wifi_ap_info_head = NULL;

SemaphoreHandle_t g_wifi_ap_info_mutex;

// the ESP interface is unclear about whether these 
// functions are thread safe against each other, and rather 
// implies they are not. Create a mutex.
SemaphoreHandle_t g_wifi_scan_mutex;

//
/// forward references
//

wifi_ap_info_t *wifi_multi_find(const uint8_t *ssid);


const char *get_authmode_str(int authmode_id) {
    switch(authmode_id) {
        case WIFI_AUTH_OPEN:
           return( "WIFI_AUTH_OPEN" );
        case WIFI_AUTH_WEP:
           return( "WIFI_AUTH_WEP" );
        case WIFI_AUTH_WPA_PSK:
           return( "WIFI_AUTH_WPA_PSK" );
        case WIFI_AUTH_WPA2_PSK:
           return( "WIFI_AUTH_WPA2_PSK" );
        case WIFI_AUTH_WPA_WPA2_PSK:
           return( "WIFI_AUTH_WPA_WPA2_PSK");
    }
    return("Unknown");
}

//
// Call this after a successful scan to update internal data structures
// so we can record what we're within range of when we try to connect
//
// If you also want information printed, set print to true
//

static void wifi_scan_update(bool doprint)
{
    uint16_t ap_count = 0;
    wifi_ap_record_t *ap_list;
    uint8_t i;

    int64_t now = esp_timer_get_time(); // time in microseconds since boot

    // we want to make sure a scan isn't working at the same time as this.
    // it's unclear what might happen in the backgroun.
    // at least, lets not execute a scan at the same time.
    if( pdFALSE == xSemaphoreTake(g_wifi_scan_mutex, 1000 / portTICK_PERIOD_MS)) {
        ESP_LOGW(TAG," could not update AP list, could not take scan mutex");
        ESP_LOGW(TAG," could result in a memory leak, because not calling scan_get_ap_records?");
        return;
    }

    esp_wifi_scan_get_ap_num(&ap_count);    
    if (doprint) { printf("--------scan count of AP is %d-------\n", ap_count); }
    if (ap_count <= 0) {
        xSemaphoreGive(g_wifi_scan_mutex);
        return; 
    }

    //malloc every time??? really??? are you just looking for fragmentation trouble?
    ap_list = (wifi_ap_record_t *)malloc(ap_count * sizeof(wifi_ap_record_t));
    if (ap_list == NULL) {
    	ESP_LOGW(TAG," scan: malloc failed, ap_count %d try later ",(int)ap_count);
        xSemaphoreGive(g_wifi_scan_mutex);
    	return;
    }
    // this might not be the best idea, aren't there
    // cases you'd just like to continue? Throws if error.
    ESP_ERROR_CHECK(esp_wifi_scan_get_ap_records(&ap_count, ap_list));  

    // don't need to hold the mutex while copying
    xSemaphoreGive(g_wifi_scan_mutex);

    // regarding the best one, this can get tricky, because there might be
    // multiple APs with the same name. To handle this, if the time is the same,
    // only make the RSSI better

    if (doprint) {
        printf("======================================================================\n");
        printf("             SSID             |    RSSI    |           AUTH           \n");
        printf("======================================================================\n");
    }

