bbulkow/esp32/wifi_station/main/wifi_station_main.c
    for (i = 0; i < ap_count; i++) 
    {
        if (doprint) {
            printf("%26.26s    |    % 4d    |    %22.22s\n", ap_list[i].ssid, ap_list[i].rssi, get_authmode_str(ap_list[i].authmode) );
        } /* doprint */

        // update the stats we have about this ap
        ESP_LOGV(TAG," scan: updating stats for ssid %s",ap_list[i].ssid);
        wifi_ap_info_t *ap_info = wifi_multi_find(ap_list[i].ssid);
        if (ap_info) {
            ap_info->authmode = ap_list[i].authmode;
            if (ap_info->last_seen < now) {
                ap_info->last_rssi = ap_list[i].rssi;
                ap_info->last_seen = now;
                ESP_LOGV(TAG," scan: updated stats for ssid %s seen %lld rssi %d",
                    ap_list[i].ssid,ap_info->last_seen,ap_info->last_rssi);
            }
            // multiple APs with same name, take best RSSI
            else {
                ESP_LOGV(TAG," scan: last seen is now? only update RSSI: ssid %s",ap_list[i].ssid);
                if (ap_info->last_rssi < ap_list[i].rssi) {
                    ap_info->last_rssi = ap_list[i].rssi;
                }
            }
        }
        else {
            ESP_LOGV(TAG," scan: can't update ssid %s not found",(const char *)ap_list[i].ssid);
        }
    }

    free(ap_list);
}

static void wifi_event_handler(void* arg, esp_event_base_t event_base, 
                                int32_t event_id, void* event_data)
{
    if ( event_base == WIFI_EVENT ) {
        switch ( event_id ) {
            case WIFI_EVENT_STA_START:
                ESP_LOGD(TAG, "received STA_START, now connecting");
                g_is_connected = false;
                g_is_connecting = false;
                break;
            case WIFI_EVENT_STA_CONNECTED:
            {
                wifi_event_sta_connected_t *ev_conn = (wifi_event_sta_connected_t *)event_data;
                ESP_LOGD(TAG, "received STA_CONNECTED channel %d",ev_conn->channel);

                // Look up ssid, mark as success
                wifi_ap_info_t *ap = wifi_multi_find( ev_conn->ssid );
                if (ap) {
                    ap->successes++;
                }

                g_is_connected = true;
                g_is_connecting = false;
                break;
            }
            case WIFI_EVENT_STA_DISCONNECTED:
            {
                wifi_event_sta_disconnected_t *ev_dis = (wifi_event_sta_disconnected_t *)event_data;

                ESP_LOGI(TAG, "EVENT_STA_DISCONNECTED: ssid %s reason %d: retry to connect to the AP?",ev_dis->ssid, ev_dis->reason);
                if (ev_dis->reason == WIFI_REASON_AUTH_FAIL) {
                    ESP_LOGI(TAG, "EVENT_STA_DISCONNECTED: reason %d: auth fail, not likely!",ev_dis->reason);
                }
                // Look up ssid, mark as failed
                wifi_ap_info_t *ap = wifi_multi_find( ev_dis->ssid );
                if (ap) {
                    ap->fails++;
                }

                // esp_wifi_connect();
                // xEventGroupClearBits(s_wifi_event_group, WIFI_CONNECTED_BIT);
                // s_retry_num++;
                g_is_connected = false;
                g_is_connecting = false;

                break;
            }
            case WIFI_EVENT_SCAN_DONE:
            {
                g_is_scanning = false;
                wifi_event_sta_scan_done_t *ev_sc = (wifi_event_sta_scan_done_t *)event_data;
                ESP_LOGD(TAG, "WIFId_EVENT_SCAN_DONE status %d numaps %d",ev_sc->status,ev_sc->number);
                if (ev_sc->status == 0) { // 0 is success
                    // should do something fancier --- look at the log level???
                    wifi_scan_update(false/*print*/);
                }
                break;
            }
            default:
                ESP_LOGI(TAG, "unhandled wifi event %d",event_id);
                break;
        }
    }

// NB: below is the ESP function 'IP2STR'. This composes the IP address into 4 ints and thus must be used
// with a format string of %d.%d.%d.%d, which is what IPSTR is. This is a supported ESP function despite the poor prefix
// the alternate is 'esp_ip4addr_ntoa', which creates a string, and ints are better than strings, admittedly.
// the underlying function for parsing out the bytes is: esp_ip4_addr1_16(ipaddr) (1,2,3,4)

    else if (event_base == IP_EVENT) {
    	ip_event_got_ip_t* event;
        switch ( event_id ) {
            case IP_EVENT_STA_GOT_IP:
                event = (ip_event_got_ip_t*) event_data;
                ESP_LOGI(TAG, "got ip:" IPSTR,
                         IP2STR(&event->ip_info.ip));
                s_retry_num = 0;
                xEventGroupSetBits(s_wifi_event_group, WIFI_CONNECTED_BIT);
                break;
            case IP_EVENT_STA_LOST_IP:
                // informative really
                ESP_LOGI(TAG, "lost ip:" );
                break;
            default:
                ESP_LOGI(TAG, "unhandled ip event %d",event_id);
                break;
        }
    }
    else {
    	// event base looks like it should be an integer, but it's a structure,
    	// and it's not clear what inside you might print
        ESP_LOGI(TAG, "unknown event base");
    }

}

// Call after esp_wifi_start
static void wifi_scan_task(void *pvParameters) {

    wifi_scan_config_t scan_config = {
            .ssid = 0,
            .bssid = 0,
            .channel = 0,   /* 0--all channel scan */
            .show_hidden = 1,
            .scan_type = WIFI_SCAN_TYPE_PASSIVE,   // active scans beacon out and cause network traffic.
                                                    // in most environments, you probably want a passive scan
            .scan_time.active.min = 80,
            .scan_time.active.max = 120,
    };

    while (1)
    {

        // I am worried this is not thread safe, so protect
        if( pdTRUE == xSemaphoreTake(g_wifi_scan_mutex, 1000 / portTICK_PERIOD_MS)) {
            // I read you should not scan while connecting
            if (g_is_connecting == false) {
                ESP_LOGD(TAG, "scan started: ");
                esp_err_t err = esp_wifi_scan_start(&scan_config, true);
                if (err == ESP_OK) {
                    g_is_scanning = true;
                }
            }
            else {
                ESP_LOGV(TAG, "skipping scan while connecting: ");
            }
            xSemaphoreGive(g_wifi_scan_mutex);
        }

        vTaskDelay(1000 / portTICK_PERIOD_MS);
    }

