bbulkow/esp32/wifi_station/main/wifi_station_main.c
}

// functions for SSID, which are defined as unsigned chars not signed chars
// returns size copied
inline int u8cmp( const uint8_t *s1, const uint8_t *s2) {
    return( strcmp( (const char *)s1, (const char *) s2));
}

// returns pointer to destination
inline char *u8cpy( uint8_t *dst, const uint8_t *src) {
    return( strcpy( (char *)dst, (const char *) src));
}

// Finds an AP in the list
// not yet thread safe and we're using threads! Assumes all are registered
// forever --- fixme, make that structure reference counted
//
// INTERNAL
wifi_ap_info_t *
wifi_multi_find(const uint8_t *ssid)
{
    wifi_ap_info_t *r = 0;

    // quickly rip through the datastructure, all in memory access, ok to hold mutex
    if( pdTRUE == xSemaphoreTake(g_wifi_ap_info_mutex, 1000 / portTICK_PERIOD_MS)) {

        wifi_ap_info_t *c = g_wifi_ap_info_head;

        while (c) {
            if (u8cmp( c->ssid, ssid ) == 0 ) {
                r = c;
                break;
            }
            else {
                c = c->next;
            }
        }

        xSemaphoreGive(g_wifi_ap_info_mutex);
    }
    else {
        ESP_LOGD(TAG, "could not take wifi semapore for a find, failing");
        return( NULL );
    }

    return(r);

}


// 0 is success, others are failure
static int wifi_multi_ap_add(const char* ssid, const char *password) {

	if (ssid == NULL)	return(-1);
	if (strlen(ssid) + 1 > SSID_LEN) return(-1);
	// password allowed to be null for open APs
	if (password && ( strlen(password) + 1 > PASSWORD_LEN ) ) return(-1);

	wifi_ap_info_t *ap_info = malloc(sizeof(wifi_ap_info_t));
	if (ap_info == 0) return(-1);

	u8cpy(ap_info->ssid, (const uint8_t *) ssid);

	if (password)      u8cpy(ap_info->password, (const uint8_t *) password);
	else               ap_info->password[0] = 0;

	ap_info->authmode = 0;
	ap_info->successes = 0;
	ap_info->fails = 0;
	ap_info->wifi_err = 0;
	ap_info->last_rssi = -1000; //??? what is a "invalid" value for rssi? something very negative?
    ap_info->last_seen = 0;

	// need a mutex here -- shouldn't contend much?
	if( pdFALSE == xSemaphoreTake(g_wifi_ap_info_mutex, 1000 / portTICK_PERIOD_MS)) {
        free(ap_info);
        return(-1);
    }

	ap_info->next = g_wifi_ap_info_head;
	g_wifi_ap_info_head = ap_info;
	xSemaphoreGive(g_wifi_ap_info_mutex);

	return(0);

}

// right now, I don't properly protect this data structure.
// I hand around the allocated SSID structures without a care in the world
// There fore I can't really remove one .... can only add this
// if the code gets a little more complex
#if 0
static int wifi_multi_ap_remove(const char *ssid) {

	bool found = false;

	// quickly rip through the datastructure, all in memory access, ok to hold mutex
	if( pdTRUE == xSemaphoreTake(g_wifi_ap_info_mutex, 1000 / portTICK_PERIOD_MS)) {

		wifi_ap_info_t *c = g_wifi_ap_info_head;
		wifi_ap_info_t *prev;

		while (c) {
			if (u8cmp( c->ssid, (const uint8_t *) ssid ) == 0 ) {
				if ( c == g_wifi_ap_info_head ) {
					g_wifi_ap_info_head = c->next;
				}
				else {
					c->next = prev;
				}
				free(c);
				found = true;
				break;
			}
			else {
				prev = c;
				c = c->next;
			}
		}

		xSemaphoreGive(g_wifi_ap_info_mutex);
	}
	else {
		ESP_LOGI(TAG, "wifi_multi_ap_remove: could not take mutex");
		return(-1);
	}
	if ( !found ) {
		ESP_LOGI(TAG, "wifi_multi_ap_remove: could not find ssid %s",ssid);
		return(-1);
	}


	return(0);
}
#endif // ap_remove

//
// This has the magic because it'll look through and find the best combination of 
// signal strength and recent. Eventually also avoid ones that you've failed with.

wifi_ap_info_t *
wifi_multi_find_best()
{
    wifi_ap_info_t *r = 0;
    int64_t now = esp_timer_get_time();

    if( pdFALSE == xSemaphoreTake(g_wifi_ap_info_mutex, 1000 / portTICK_PERIOD_MS)) {
        ESP_LOGW(TAG,"Could not get ap info mutex, timedout");
        return(0);
    }

    // quickly rip through the datastructure, all in memory access, ok to hold mutex
    wifi_ap_info_t *c = g_wifi_ap_info_head;

    while (c) {
        // make sure I've seen it at least once before
        if (c->last_seen == 0) {
            ESP_LOGV(TAG," ssid %s: skipping not seen yet",(const char *)c->ssid);
            goto NEXT;
        }
        // make sure if its encrypted I have the username and password
        if ( (c->password[0] == 0) &&
             (c->authmode != WIFI_AUTH_OPEN) ) {
            ESP_LOGV(TAG," ssid %s: encrypted but no password",(const char *)c->ssid);
            goto NEXT;
        }

#if 0 // skip this heuristic for now.... 
        // if I tried and failed, skip? unless maybe it's the only one left?
        if ( c->failed ) {
            print(" ssid %s: failed before, skipping\n",(const char *)c->ssid);
            break;
        }
#endif
        // make sure it's not stale
        if ( now > ( c->last_seen + WIFI_STALE_TIME ) ) {
//          not sure how to log int64_t ??? 
            ESP_LOGV(TAG, " ssid %s: seems stale, last seen %lld, now %lld skipping",
                (const char *)c->ssid,c->last_seen, now);
            goto NEXT;
        }

        // this is better than nothing!
        if (r == 0) {
            ESP_LOGV(TAG," ssid %s: selecting because nothing else",(const char *)c->ssid);
            r = c;
            goto NEXT;
        }

        ESP_LOGV(TAG," ssid best %s: suc %d fail %d rssi %d",(const char *)r->ssid,r->successes,r->fails,r->last_rssi);

        // Heuristic. Want fails to count for something, and successes
        int c_factor = (c->successes * 2) - c->fails;
        int r_factor = (r->successes * 2) - r->fails;
        if (c_factor > r_factor) {
            ESP_LOGV(TAG," ssid %s: selecting because factors: r: %d vs c: %d ",(const char *)c->ssid,r_factor,c_factor);
            r = c;
            goto NEXT;
        }   

        // now let's go for RSSI
        if (c->last_rssi > r->last_rssi) {
            ESP_LOGV(TAG," ssid %s: selecting because better rssi: %d vs %d ",(const char *)c->ssid,r->last_rssi,c->last_rssi);
            r = c;
            goto NEXT;
        }

