bbulkow/esp32/wifi_station/main/wifi_station_main.c
NEXT:
        c = c->next;

    } /* end while */


    xSemaphoreGive(g_wifi_ap_info_mutex);

    return(r);

}


// This task attempts to connect to the current best if disconnected only.
// The list of passwords is taken from the registered set

static void wifi_connect_task(void *pvParameters) {

    while(1)
    {
	    // What state am I in? if disconnected, start a connect
	    if ((g_is_connected == false) && (g_is_connecting == false)) {

            wifi_ap_info_t *ap = wifi_multi_find_best();
            if (ap) {

                wifi_config_t wifi_config = {
                    .sta = {
                        .scan_method = WIFI_ALL_CHANNEL_SCAN,
                        .sort_method = WIFI_CONNECT_AP_BY_SIGNAL,
                        .threshold.rssi = 0, // default?
                        .threshold.authmode = ap->authmode,
                    },
                };
                u8cpy(wifi_config.sta.ssid, ap->ssid);
                u8cpy(wifi_config.sta.password, ap->password);

                // this is how we set the SSID and password to use
                // note, the interface type being STA is not documented, it seems
                // when you set a config, you might end up cancelling a scan
                ESP_ERROR_CHECK(esp_wifi_set_config(ESP_IF_WIFI_STA, &wifi_config) );

                ESP_LOGI(TAG, "CONNECT TO ap SSID:%s password:%s",
                         (const char *) ap->ssid, (const char *) ap->password);
                
                g_is_connecting = true;
                esp_err_t err = esp_wifi_connect();
                if (err != ESP_OK) {
                    g_is_connecting = false;
                    ESP_LOGW(TAG, " attempted to connect, couldn't, error %d",err);
                }
            }

		}

		vTaskDelay(1000 / portTICK_PERIOD_MS);

    }

}

static TaskHandle_t g_xScanTask;
static TaskHandle_t g_xConnectTask;

// Initis the wifi units, sets up the event loops, and kicks
// off the scanning task and the connecting task

void wifi_multi_start()
{
    s_wifi_event_group = xEventGroupCreate();

    // beginning of new esp-idf network section....
    // please see 
    ESP_ERROR_CHECK( esp_netif_init() );

    // need somewhere to statically define mutex. Should be a better way, like how Linux
    // does it, so you don't have to put it in your init code
    // CREATE MUTEX STATIC - static allocations off by default, in the esp32
    // branch. Don't want to make everyone have to turn that on, so going
    // to use dynamic for now.
	g_wifi_ap_info_mutex = xSemaphoreCreateMutex( );

    g_wifi_scan_mutex = xSemaphoreCreateMutex();

    ESP_ERROR_CHECK(esp_event_loop_create_default());

    // this is the new step in ESP-IDF 4.1++ required to tell the IP stack about the interface
    g_wifi_netif = esp_netif_create_default_wifi_sta();

    wifi_init_config_t wifi_config = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&wifi_config));

    // instance register will return the instance of the event handler you were registered with,
    // and allows you to deregister, because you can deregister from the correct event loop.
    // however, you can pass null if you don't intend to deregister, ie, only when the event
    // handler is removed, so null for the instance is fine
    ESP_ERROR_CHECK(esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &wifi_event_handler, NULL, NULL));
    ESP_ERROR_CHECK(esp_event_handler_instance_register(IP_EVENT, IP_EVENT_STA_GOT_IP, &wifi_event_handler, NULL, NULL));

    wifi_country_t wifi_country = {
        .cc = "US",
        .schan = 1,
        .nchan = 11,
    };

    // when plugged in ( not on battery ), why not use the normal power mode?
    // PS is POWER SAVE, WIFI_PS_MIN_MODEM wakes up every DTIM period to receive packets
    // WIFI_PS_MAX_MODEM , which listens to the station config about when to receive beacons
    // WIFI_PS_NONE just keeps the chip on all the time
    // ( not entirely sure if this gets wiped out by the set mode, hope not? )
    ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_NONE) );

    // I am a client, mode STA
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA) );

    // this sets a lot of things we may not right at the beginning. We want to scan first and connect later,
    // so don't set the config of the AP you'd like to connect to.
    //ESP_ERROR_CHECK(esp_wifi_set_config(ESP_IF_WIFI_STA, &wifi_init_config) );
    ESP_ERROR_CHECK(esp_wifi_set_country(&wifi_country));

    ESP_ERROR_CHECK(esp_wifi_start() );

    // kick off scan and connect tasks
    xTaskCreate(wifi_scan_task, "wifi_scan_task",4096/*stacksizewords*/, 
                (void *) NULL/*param*/, 5 /*pri*/, &g_xScanTask/*createdtask*/);

    xTaskCreate(wifi_connect_task, "connect",4096/*stacksizewords*/, 
                (void *) NULL/*param*/, 5 /*pri*/, &g_xConnectTask/*createdtask*/);

    ESP_LOGD(TAG, "wifi_init_multi finished.");

}



void app_main()
{
    //Initialize NVS --- 
    // NOTE! Does this clear NVS? Or just init access? Looks like gives access because it clears it if there are problems
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
      ESP_ERROR_CHECK(nvs_flash_erase());
      ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    // Since this seems to be working, set the log level to warning instead of info
    esp_log_level_set(TAG, ESP_LOG_INFO);
    ESP_LOGI(TAG, "ESP_WIFI_MODE_INIT_STA");

    // in ESP-IDF is seems there are about 8 tasks
    uint16_t initial_tasks = uxTaskGetNumberOfTasks();

    wifi_multi_start();
    wifi_multi_ap_add("sisyphus", "!medea4u");
    wifi_multi_ap_add("bb-ap-x", "landshark");
    wifi_multi_ap_add("laertes", "!medea4u");
    // put this back, it's a good idea, just right now it's also the above one
    //wifi_multi_ap_add(EXAMPLE_ESP_WIFI_SSID, EXAMPLE_ESP_WIFI_PASS);

    // wait till they stop
    while(1) {

      uint16_t n_tasks = uxTaskGetNumberOfTasks();

      /* let's see how many tasks exist, and terminate when they go away */
      /* future method will be to create a queue and signal back on death */
      // the interesting bit about this talks about the 'idle task' which will
      // reap deleted tasks... it it out there? Did I need to configure
      // something to start it?
      ESP_LOGD(TAG,"tasks remaining: %u waiting for %u\n",n_tasks,initial_tasks);

      if (n_tasks == initial_tasks) {
        printf("my tasks must have died --- let's restart!\n");
        fflush(stdout);
        esp_restart();
      }

      vTaskDelay(5000 / portTICK_PERIOD_MS);

    }
}
